**Terraform Format and Style🖌** `success`
**Terraform Initialization ⚙️** `success`
**Terraform Plan 📖** `success`
**Terraform Validation 🤖** `success`

<details><summary>Show Plan</summary>

```
module.dnsimple_fastmail_maildrip_net.dnsimple_zone_record.srv_submission: Refreshing state... [id=26932501]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.srv_pop3s: Refreshing state... [id=26880821]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.srv_pop3s: Refreshing state... [id=26161962]
module.dnsimple_github_pages.dnsimple_zone_record.cname-record-www: Refreshing state... [id=26161971]
module.dnsimple_short_io.dnsimple_zone_record.a_record_2: Refreshing state... [id=26982611]
module.dnsimple_short_io.dnsimple_zone_record.a_record_1: Refreshing state... [id=26982612]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.srv_carddavs: Refreshing state... [id=26161943]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.srv_caldavs: Refreshing state... [id=26161946]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.srv_imaps: Refreshing state... [id=26161934]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.srv_imaps: Refreshing state... [id=26880816]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.mx_10[0]: Refreshing state... [id=26880822]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.mail: Refreshing state... [id=26161935]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.dmarc[0]: Refreshing state... [id=26161942]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.srv_jmap: Refreshing state... [id=26161947]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.spf: Refreshing state... [id=26161968]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.dmarc[0]: Refreshing state... [id=26161945]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.srv_submission: Refreshing state... [id=26161936]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.srv_jmap: Refreshing state... [id=26880820]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.srv_carddavs: Refreshing state... [id=26880813]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.srv_submission: Refreshing state... [id=26880815]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.srv_imaps: Refreshing state... [id=26161958]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.dmarc[0]: Refreshing state... [id=26880818]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.mx_20[0]: Refreshing state... [id=26880817]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.mx_10[0]: Refreshing state... [id=26161966]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.srv_submission: Refreshing state... [id=26161944]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.mx_20[0]: Refreshing state... [id=26161960]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.spf: Refreshing state... [id=26880826]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.srv_caldavs: Refreshing state... [id=26161939]
module.dnsimple_fastmail_maildrip_net.dnsimple_zone_record.mx_10[0]: Refreshing state... [id=26932504]
module.dnsimple_fastmail_maildrip_net.dnsimple_zone_record.srv_caldavs: Refreshing state... [id=26932505]
module.dnsimple_fastmail_maildrip_net.dnsimple_zone_record.dkim[2]: Refreshing state... [id=26932508]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.srv_carddavs: Refreshing state... [id=26161972]
module.dnsimple_fastmail_maildrip_net.dnsimple_zone_record.srv_jmap: Refreshing state... [id=26932507]
dnsimple_zone_record.pm_bounces_witteman_me: Refreshing state... [id=27015888]
dnsimple_zone_record.synology_nas: Refreshing state... [id=26811272]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.srv_caldavs: Refreshing state... [id=26880814]
dnsimple_zone_record.culturedcode_help_redirect: Refreshing state... [id=27039988]
dnsimple_zone_record.wtmn_email_redirect: Refreshing state... [id=26984574]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.srv_jmap: Refreshing state... [id=26161937]
module.dnsimple_fastmail_maildrip_net.dnsimple_zone_record.mx_20[0]: Refreshing state... [id=26932506]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.mx_20[0]: Refreshing state... [id=26161967]
dnsimple_zone_record.witteman_email_redirect: Refreshing state... [id=26984573]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.spf: Refreshing state... [id=26161961]
module.dnsimple_fastmail_maildrip_net.dnsimple_zone_record.spf: Refreshing state... [id=26932511]
dnsimple_zone_record.synology_help_redirect: Refreshing state... [id=27039989]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.srv_pop3s: Refreshing state... [id=26161949]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.mx_10[0]: Refreshing state... [id=26161940]
module.dnsimple_fastmail_maildrip_net.dnsimple_zone_record.srv_carddavs: Refreshing state... [id=26932502]
module.dnsimple_github_pages.dnsimple_zone_record.alias-record-root: Refreshing state... [id=26161929]
dnsimple_zone_record.google_postmaster_verification: Refreshing state... [id=26331373]
module.dnsimple_fastmail_maildrip_net.dnsimple_zone_record.mail: Refreshing state... [id=26932498]
dnsimple_zone_record.files_wtmn_net_alias: Refreshing state... [id=27004600]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.dkim[2]: Refreshing state... [id=26161933]
module.dnsimple_fastmail_maildrip_net.dnsimple_zone_record.dkim[0]: Refreshing state... [id=26932509]
module.dnsimple_fastmail_maildrip_net.dnsimple_zone_record.dkim[1]: Refreshing state... [id=26932510]
module.dnsimple_fastmail_maildrip_net.dnsimple_zone_record.dmarc[0]: Refreshing state... [id=26932512]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.dkim[0]: Refreshing state... [id=26161931]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.dkim[1]: Refreshing state... [id=26161932]
module.dnsimple_fastmail_maildrip_net.dnsimple_zone_record.srv_imaps: Refreshing state... [id=26932503]
dnsimple_zone_record.postmark_domainkey_witteman_me: Refreshing state... [id=27015887]
dnsimple_zone_record.home_wtmn_net: Refreshing state... [id=26881012]
dnsimple_zone_record.github_redirect: Refreshing state... [id=26395267]
dnsimple_zone_record.google_postmaster_verification_georgewitteman_com: Refreshing state... [id=26331623]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.dkim[2]: Refreshing state... [id=26161955]
dnsimple_zone_record.culturedcode_blog_redirect: Refreshing state... [id=27039987]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.dkim[0]: Refreshing state... [id=26161953]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.dkim[1]: Refreshing state... [id=26161954]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.dkim[2]: Refreshing state... [id=26880825]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.dkim[0]: Refreshing state... [id=26880823]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.dkim[1]: Refreshing state... [id=26880824]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.mail: Refreshing state... [id=26880812]
module.dnsimple_fastmail_maildrip_net.dnsimple_zone_record.srv_pop3s: Refreshing state... [id=26932500]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.mail: Refreshing state... [id=26161951]
aws_kms_key.dynamo_db_kms: Refreshing state... [id=1a1ca031-daf5-4f17-aa7d-2d2d2ca5a865]
aws_s3_bucket.log_bucket: Refreshing state... [id=georgewitteman-terraform-logs]
aws_dynamodb_table.terraform_locks: Refreshing state... [id=terraform-locks]
aws_s3_bucket_public_access_block.log_bucket: Refreshing state... [id=georgewitteman-terraform-logs]
aws_s3_bucket.terraform_state: Refreshing state... [id=georgewitteman-terraform-state]
aws_s3_bucket_public_access_block.terraform_state: Refreshing state... [id=georgewitteman-terraform-state]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_dynamodb_table.terraform_locks has changed
  ~ resource "aws_dynamodb_table" "terraform_locks" {
        id             = "terraform-locks"
        name           = "terraform-locks"
        tags           = {}
        # (7 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.dnsimple_squarespace_marcywitteman_com.dnsimple_zone_record.a_records[0] will be created
  + resource "dnsimple_zone_record" "a_records" {
      + id             = (known after apply)
      + priority       = (known after apply)
      + qualified_name = (known after apply)
      + ttl            = "300"
      + type           = "A"
      + value          = "198.185.159.144"
      + zone_id        = (known after apply)
      + zone_name      = "marcywitteman.com"
    }

  # module.dnsimple_squarespace_marcywitteman_com.dnsimple_zone_record.a_records[1] will be created
  + resource "dnsimple_zone_record" "a_records" {
      + id             = (known after apply)
      + priority       = (known after apply)
      + qualified_name = (known after apply)
      + ttl            = "300"
      + type           = "A"
      + value          = "198.185.159.145"
      + zone_id        = (known after apply)
      + zone_name      = "marcywitteman.com"
    }

  # module.dnsimple_squarespace_marcywitteman_com.dnsimple_zone_record.a_records[2] will be created
  + resource "dnsimple_zone_record" "a_records" {
      + id             = (known after apply)
      + priority       = (known after apply)
      + qualified_name = (known after apply)
      + ttl            = "300"
      + type           = "A"
      + value          = "198.49.23.144"
      + zone_id        = (known after apply)
      + zone_name      = "marcywitteman.com"
    }

  # module.dnsimple_squarespace_marcywitteman_com.dnsimple_zone_record.a_records[3] will be created
  + resource "dnsimple_zone_record" "a_records" {
      + id             = (known after apply)
      + priority       = (known after apply)
      + qualified_name = (known after apply)
      + ttl            = "300"
      + type           = "A"
      + value          = "198.49.23.145"
      + zone_id        = (known after apply)
      + zone_name      = "marcywitteman.com"
    }

  # module.dnsimple_squarespace_marcywitteman_com.dnsimple_zone_record.verify_cname will be created
  + resource "dnsimple_zone_record" "verify_cname" {
      + id             = (known after apply)
      + name           = "ygcg8lysbebsftxsez6l"
      + priority       = (known after apply)
      + qualified_name = (known after apply)
      + ttl            = "300"
      + type           = "CNAME"
      + value          = "verify.squarespace.com"
      + zone_id        = (known after apply)
      + zone_name      = "marcywitteman.com"
    }

  # module.dnsimple_squarespace_marcywitteman_com.dnsimple_zone_record.www_cname will be created
  + resource "dnsimple_zone_record" "www_cname" {
      + id             = (known after apply)
      + name           = "www"
      + priority       = (known after apply)
      + qualified_name = (known after apply)
      + ttl            = "300"
      + type           = "CNAME"
      + value          = "ext-cust.squarespace.com"
      + zone_id        = (known after apply)
      + zone_name      = "marcywitteman.com"
    }

Plan: 6 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @georgewitteman, Action: `pull_request`*